In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("/Users/marinagasco/Desktop/VS_Bootcamp/Módulo_3/mod-3-pareja-1/medallas.csv")

**Pair Pandas**

El objetivo de la clase de hoy será crear unos cuántos DataFrames y Series a través de los siguientes ejercicios:

¿Qué diferencia hay entre una Serie y un DataFrame?

Momento de trabajar con Series. Contesta a las siguientes preguntas:

Crea dos listas:

Una que se llame "valores" que tenga 7 números aleatorios.

Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [9]:
import numpy as np
import random

In [33]:
#serie unidimensional /df bidimensional. 

valores = pd.Series (np.random.randint(1,101, size = 7))

list(valores)

len(valores)

7

In [34]:
indices = pd.Series (["Lunes", "Martes", "Miércoles", "Jueves", "Viernes", "Sábado", "Domingo"])

list(indices)

len(indices)

7

A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [30]:
nueva_serie= pd.Series(valores, index= indices, name = "valores") 

nueva_serie

Lunes       NaN
Martes      NaN
Miércoles   NaN
Jueves      NaN
Viernes     NaN
Sábado      NaN
Domingo     NaN
Name: valores, dtype: float64

In [32]:
serie = pd.Series(valores, index=indices, name="valores")

serie

Lunes       NaN
Martes      NaN
Miércoles   NaN
Jueves      NaN
Viernes     NaN
Sábado      NaN
Domingo     NaN
Name: valores, dtype: float64

A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.

In [39]:
serie_2 = pd.Series(dict(zip(indices, valores)), name="valores")

serie_2

type(serie_2)

pandas.core.series.Series

Crea una Serie con el diccionario creado en el punto anterior.

In [41]:
dicc = dict(serie_2)

dicc

{'Lunes': np.int64(22),
 'Martes': np.int64(7),
 'Miércoles': np.int64(14),
 'Jueves': np.int64(45),
 'Viernes': np.int64(91),
 'Sábado': np.int64(79),
 'Domingo': np.int64(44)}

¿Qué forma tiene esta última Serie?

In [47]:
serie_2.shape

(7,)

¿Qué tipo de datos tiene?

In [49]:
serie_2.dtypes

dtype('int64')

¿Qué tamaño tiene?

In [45]:
serie_2.size

7

¿Cuáles son los índices de la Serie?

In [46]:
serie_2.index

Index(['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado',
       'Domingo'],
      dtype='object')

¿Y los values?

In [48]:
serie_2.values

array([22,  7, 14, 45, 91, 79, 44])


Extrae el valor para el índice "lunes".

In [55]:
serie_2["Lunes"]

np.int64(22)

In [63]:
serie_2[0:1]

Lunes    22
Name: valores, dtype: int64

Extrae el valor para el índice "lunes", "martes" y "miércoles".

In [59]:
serie_2[0:3]

Lunes        22
Martes        7
Miércoles    14
Name: valores, dtype: int64

Extrae el valor para el índice "lunes" y "domingo".

In [69]:
serie_2[0::][-1::]

Domingo    44
Name: valores, dtype: int64

Es el turno de los DataFrames.

Crea un array de dos dimensiones con 4 filas y 3 columnas.

In [76]:
array_1 = np.random.randint(0,100, size = (4, 3))

array_1

array([[57, 37, 83],
       [29,  6,  5],
       [47,  5,  4],
       [50, 25, 96]])

Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [80]:
array_2 = pd.DataFrame(array_1, columns =["España", "Francia", "Italia"])

array_2

   España  Francia  Italia
0      57       37      83
1      29        6       5
2      47        5       4
3      50       25      96

Descarga el archivo "medallas" y carga el DataFrame.

In [83]:
df = pd.read_csv("/Users/marinagasco/Desktop/VS_Bootcamp/Módulo_3/mod-3-pareja-1/medallas.csv", index_col=0)

df

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

Usando el loc extrae todas las columnas de la fila de Tailandia.

In [113]:
df.loc[7]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

In [93]:
df.iloc[6]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

Usando el loc extrae todas las columnas de China e Irán.

In [120]:
df.loc[[1, 4],:]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [122]:
df.loc[[1, 4],["Oro", "Plata","Bronce"]]

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

Usando el iloc extrae la información de la India. Devolved todas las columnas.

In [123]:
df.iloc[5]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [128]:
df.iloc[1::2, :] #seleccionar todas las filas que comienzan en el índice 1 (la segunda fila) y luego tomar cada segunda fila (lo que corresponde a los índices impares).
                 #: seleccionar todas las columnas.

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

In [129]:
df.iloc[1::2, [1,2,3]]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

In [ ]:
df.loc[[1, 4],:]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

Contesta a las siguientes preguntas:

¿Qué país consiguió más de 200 medallas de oro?

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.